src/integ-test/bdd-test/resources/xml/pspNotifyPaymentV2_OK_delay_noOptional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pfn="http://pagopa-api.pagopa.gov.it/psp/pspForNode.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <pfn:pspNotifyPaymentV2Res>
            <delay>$delay</delay>
            <outcome>$outcome</outcome>
        </pfn:pspNotifyPaymentV2Res>
    </soapenv:Body>
</soapenv:Envelope>